Repository: sarasaudh/kids-logic
Catalog: KidsLogic/KidsLogic/*.lproj/Localizable.strings
Languages: ar

source: Login
ar: تسجيل الدخول

source: Register
ar: انشاء حساب جديد

source: email
ar: البريد الالكتروني

source: password
ar: الرقم السري

source: Your Name
ar: اسمك

source: Welcome
ar: مرحباً

source: PLAY
ar: العب

source: STUDY
ar: ادرس

source: name
ar: 🧒🏻الأسم

source: status
ar: ✨الحاله

source: save
ar: حفظ

source: sign Out
ar: تسجيل الخروج

source: READ 📖
ar: اقرأ 📖

source: WACH 🎞
ar: شاهد 🎞

source: profile
ar: الملف الشخصي

source: Home
ar: الرئيسية

source: Lesson
ar: الدروس

source: Logic KID
ar: الدروس

source: More
ar: المزيد

source: GAME 🎮
ar: العاب 🎮

source: Video 📀
ar: فيديو 📀

source: Carton 🧩
ar: فيلم كرتون 🧩

source: Quiz 🧩
ar: اختبار 🖋

source: Self evaluation🔖
ar: التقييم الذاتي🔖

source: Evaluation
ar: التقييم

source: NEW Task➕
ar: ➕مهمة يومية

source: NEW Day 🕚
ar: يوم جديد 🕚

source: ALGORITHM
ar: الخوارزمية

source: Tasks
ar: مهامي

source: Days
ar: الايام

source: Swipe To Back 📽
ar: اسحب للخلف 📽

source: BOOLEAN
ar: القيمة المنطقية

source: BorderRadius
ar: الحدود

source: BUG
ar: خطأ برمجي

source: info
ar: عن التطبيق

source: Back
ar: عودة

source: Languge
ar: اللغة

source: Map
ar: قم بزيارتنا

source: Website
ar: الموقع الالكتروني

source: Sign Out
ar: تسجيل خروج

source: 1: Think of it this way: many introductory lessons introduce algorithms as mathematical “recipes”; and like a recipe, algorithms contain clear steps working towards an established result.
ar: فكر في الأمر بهذه الطريقة: تقدم العديد من الدروس التمهيدية الخوارزميات باعتبارها (وصفات) رياضية ؛ ومثل الوصفة ، تحتوي الخوارزميات على خطوات واضحة تعمل على تحقيق نتيجة ثابتة.

source: 2: Booleans are “truth values” — they’re a data type that can represent one of two outcomes: true or false. (In some languages, true and false can be represented as 1 or 0, but the takeaway message is the same.)
ar: القيم المنطقية هي قيم الحقيقة : إنها نوع بيانات يمكن أن تمثل إحدى نتيجتين: صواب أو خطأ. (في بعض اللغات ، يمكن تمثيل صواب وخطأ بالرقم 1 أو 0 ، لكن الرسالة الجاهزة هي نفسها.)

source: BORDER RADIUS
ar: الحدود

source: 3: A box's backgrounds, but not its border-image, are clipped to the appropriate curve (as determined by ‘background-clip’). Other effects that clip to the border or padding edge (such as ‘overflow’ other than ‘visible’) also must clip to the curve. The content of replaced elements is always trimmed to the content edge curve. Also, the area outside the curve of the border edge does not accept mouse events on behalf of the element.
ar: يتم قص خلفيات الصندوق ، ولكن ليس صورة الحدود الخاصة به ، بالمنحنى المناسب (كما هو محدد بواسطة مقطع الخلفية). التأثيرات الأخرى التي تقطع الحد أو حافة المساحة المتروكة (مثل تجاوز بخلاف المرئي) يجب أيضًا قصها مع المنحنى. يتم دائمًا اقتطاع محتوى العناصر المستبدلة إلى منحنى حافة المحتوى. أيضًا ، لا تقبل المنطقة الواقعة خارج منحنى حافة الحد أحداث الماوس نيابة عن العنصر.

source: BUG
ar: خطأ برمجي

source: 4: In IT, a bug refers to an error, fault or flaw in any computer program or a hardware system. A bug produces unexpected results or causes a system to behave unexpectedly. In short it is any behavior or result that.
ar: في تكنولوجيا المعلومات ، يشير الخطأ إلى خطأ أو خطأ أو عيب في أي برنامج كمبيوتر أو نظام أجهزة. ينتج عن الخطأ نتائج غير متوقعة أو يتسبب في تصرف النظام بشكل غير متوقع. باختصار هو أي سلوك أو نتيجة ذلك.

source: CSS
ar: التنسيق النمطي

source: 5: CSS, which stands for Cascading Style Sheets, is a language used alongside HTML to separate a webpage's content (the HTML part) from the design and formatting (the CSS part). It defines fonts, colors, margins, lines, height, width, backgrounds, images, positions and other visual aspects of a webpage, something which HTML was not originally designed to do. Simply put, CSS decides how your HTML is displayed.
ar: Cascading Style Sheets)‏ اختصارًا: سي إس إس (بالإنجليزية: CSS)‏؛ هي لغة تنسيق لصفحات الويب تهتم بشكل وتصميم المواقع، صممت خصيصا لفصل التنسيق (الألوان - الخطوط - الأزرار.. عن محتوى المستند المكتوب (بلغة مثلا إتش تي إم إل HTML) وينطبق ذلك على الألوان والخطوط والصور والخلفيات التي تستخدم في الصفحات، بمرونة وسهولة تامة. هذه التقنية تعنى بالمظهر الكلي لصفحات مواقع الويب من ألوان وصور وغيره

source: DEBUG
ar: التصحيح

source: 6: In computer programming and software development, debugging is the process of finding and resolving bugs (defects or problems that prevent correct operation) within computer programs, software, or systems.Debugging tactics can involve interactive debugging, control flow analysis, unit testing, integration testing, log file analysis, monitoring at the application or system level, memory dumps, and profiling. Many programming languages and software development tools also offer programs to aid in debugging, known as debuggers.
ar: في برمجة الكمبيوتر وتطوير البرامج ، التصحيح هو عملية البحث عن الأخطاء وحلها (عيوب أو مشاكل تمنع التشغيل الصحيح) داخل برامج الكمبيوتر أو البرامج أو الأنظمة. يمكن أن تتضمن أساليب التصحيح التصحيح التفاعلي وتحليل تدفق التحكم واختبار الوحدة واختبار التكامل وتحليل ملف السجل والمراقبة على مستوى التطبيق أو النظام وتفريغ الذاكرة والتنميط. تقدم العديد من لغات البرمجة وأدوات تطوير البرامج أيضًا برامج للمساعدة في تصحيح الأخطاء ، والمعروفة باسم المصححات.

source: DEFAULT
ar: افتراضي

source: 7:Default values are standards values that are universal to all instances of the device or model and intended to make the device as accessible as possible (out of the box) without necessitating a lengthy configuration process prior to use. The user only has to modify the default settings according to their personal preferences. In many devices, the user has the option to restore these default settings for one or all options. Such an assignment makes the choice of that setting or value more likely, this is called the default effect.
ar: القيم الافتراضية هي قيم معيارية عامة لجميع مثيلات الجهاز أو الطراز وتهدف إلى جعل الجهاز متاحًا قدر الإمكان خارج الصندوق دون الحاجة إلى عملية تكوين مطولة قبل الاستخدام. يتعين على المستخدم فقط تعديل الإعدادات الافتراضية وفقًا لتفضيلاته الشخصية. في العديد من الأجهزة ، يكون لدى المستخدم خيار استعادة هذه الإعدادات الافتراضية لواحد أو لجميع الخيارات. مثل هذا التخصيص يجعل اختيار هذا الإعداد أو القيمة أكثر احتمالًا ، وهذا ما يسمى التأثير الافتراضي.

source: HTML5
ar: تكوين صفحات الويب

source: 8: HTML5 is a markup language used for structuring and presenting content on the World Wide Web. It is the fifth and last[3] major HTML version that is a World Wide Web Consortium (W3C) recommendation. The current specification is known as the HTML Living Standard. It is maintained by the Web Hypertext Application Technology Working Group (WHATWG), a consortium of the major browser vendors (Apple, Google, Mozilla, and Microsoft).
ar: تش تي إم إل (بالإنجليزية: Hyper Text Markup Language)‏ وتختصر إلى HTML، وهي لغة تكوين صفحات مواقع الويب. و في الإصدار إتش تي إم إل 5 الجديد، يتم تقديم عدد من العناصر الجديدة والتي تسهل من فكرة تكوين الصفحات، حسب ما نقوم به يدوياً في XHTML 1.0 بالإضافة إلى تسهيل الأمور على محركات البحث في قراءة الصفحات ومعرفة ما هي أجزاء الصفحة الفعلية (الجزء العلوي (Header)، القائمة (Navigation) أو (nav)، الجزء الرئيسي (Main)، المحتوى (Sections) والجزء السفلي (Footer). كما توفر إتش تي إم إل 5 عدد من بيئات العمل المختلفة لتكوين الرسوميات والفيديو والعديد من المميزات التي تسهل الكثير مما يتم القيام به حالياً.

source: HTML
ar: ترميز النص التشعيبي

source: 9: The HyperText Markup Language, or HTML is the standard markup language for documents designed to be displayed in a web browser. It can be assisted by technologies such as Cascading Style Sheets (CSS) and scripting languages such as JavaScript.Web browsers receive HTML documents from a web server or from local storage and render the documents into multimedia web pages. HTML describes the structure of a web page semantically and originally included cues for the appearance of the document.
ar: hyperText Markup Language)‏ (اختصار إتش تي إم إل HTML)، هي لغة ترميز تستخدم في إنشاء وتصميم صفحات ومواقع الويب، وتعتبر هذه اللّغة من أقدم اللّغات وأوسعها استخداما في تصميم صفحات الويب. HTML هيكل صفحة الويب وتعطي متصفّح الإنترنت وصفا لكيفيّة عرضه لمحتوياتها، يمكن أن تساعده تقنيات مثل أوراق الأنماط المتتالية (CSS) ولغات البرمجة النصية مثل جافا سكريبت تستقبل متصفحات الويب مستندات HTML من خادم الويب أو من نظام الملفات وتعرضها، ووظيفة لغة HTML هي وصف بنية صفحات الويب هيكليًا. العناصر في HTML هي اللبنة الأساسية لبناء مستندات HTML،

source: 10: He hover effect is the alteration of the appearance of a component of the graphical interface once the mouse is hovering over it, even if it has not been selected. For example, if you hover your mouse over this word you will see that it changes color, giving you to understand that it will refer you to another link if you click on it, but you still cannot visualize what is hidden behind this word. All the user will need to visualize your effect is a mouse. It is very original when we place this effect in the caption. The e fecto hover t It is also known as hovering.
ar: تأثير التمرير هو تغيير مظهر أحد مكونات الواجهة الرسومية بمجرد تحريك الماوس فوقه ، حتى لو لم يتم تحديده. على سبيل المثال ، إذا قمت بتمرير الماوس فوق هذه الكلمة ، فسترى أنها تغير لونها ، مما يتيح لك فهم أنها ستحيلك إلى ارتباط آخر إذا قمت بالنقر فوقه ، ولكن لا يزال يتعذر عليك تصور ما هو مخفي وراء هذه الكلمة. كل ما سيحتاجه المستخدم لتصور تأثيرك هو الماوس. إنه أصلي للغاية عندما نضع هذا التأثير في التسمية التوضيحية. يُعرف أيضًا باسم hovering.

source: HEX COLOR
ar: الالوان السداسية

source: 11:Hex colors are a way of representing colors from various color models through hexadecimal values. A hexadecimal color follows the format #RRGGBB, where RR is red, GG is green, and BB is blue. These hexadecimal integers can be in a range of 00 to FF to specify the intensity of the color.
ar: الألوان السداسية هي طريقة لتمثيل الألوان من نماذج الألوان المختلفة من خلال القيم السداسية العشرية. يتبع اللون السداسي العشري التنسيق #RRGGBB ، حيث يكون RR أحمر ، GG أخضر ، BB أزرق. يمكن أن تكون هذه الأعداد الصحيحة السداسية العشرية في نطاق من 00 إلى FF لتحديد كثافة اللون.

source: HEIGHT
ar: الارتفاع

source: 12: how tall an element or opject is
ar: هو ارتفاع العنصر أو الكائن

source: FUNCTION
ar: دالة

source: 13:Functions are self contained modules of code that accomplish a specific task. Functions usually take in data, process it, and return a result. Once a function is written, it can be used over and over and over again. Functions can be called from the inside of other functions.
ar: الوظائف هي وحدات قائمة بذاتها من التعليمات البرمجية التي تنجز مهمة محددة. عادةً ما تأخذ الوظائف البيانات وتعالجها و تعيد النتيجة. بمجرد كتابة الوظيفة ، يمكن استخدامها مرارًا وتكرارًا. يمكن استدعاء الوظائف من داخل وظائف أخرى.

source: OPACITY
ar: التعتيم

source: 14: Making an element more or less see through
ar: جعل العنصر اكثر او اقل عتامة

source: NULL
ar: خالي

source: 15: empty, no value exists
ar: فارغ لا يوجد له قيمة

source: LOOP
ar: حلقه

source: 16: Doing the same action again and again
ar: تكرار نفس الحدث مراراً وتكراراً

source: JAVA SCRIPT
ar: جافا سكربت

source: 17: A Programming languge used in most websites
ar: لغة برمجة تستخدم في اغلب المواقع الالكترونية

source: IF STATEMENT
ar: جملة IF

source: 18: IF true , do this action
ar: اذا تحقق الشرط افعل الحدث المطلوب

source: SCALE
ar: الحجم

source: 19: Sets the zoom or size of item
ar: يضبط حجم العنصر بالتكبير او التصغير

source: RUNTIME
ar: وقت التشعغيل

source: 20: The period of time when a program is running
ar: دورة الوقت حينما يكون البرنامج قيد التشغيل

source: RGB COLOR
ar: الوانRGB

source: 21: Combines red,green and blue i.e. rgb(0,255,90)
ar: يجمع بين اللون الاحمر و الاخضر و الازرق في تدرج rgb(0,255,90)

source: REFRESH
ar: التحديث

source: 22: Relode the content of webpage or window
ar: اعادة تحميل محتوى الويب او النافذة

source: PIXELS
ar: بكسل

source: 23: Units of distance on digital canvas
ar: وحدات المسافة على لوحة رقمية

source: PATH
ar: المسار

source: 24: Location of file or folder on your computer or system
ar: موقع الملف أو المجلد على جهاز الكمبيوتر أو النظام الخاص بك

source: WIDTH
ar: العرض

source: 25: how wide an elment or object is
ar: مدى عرض عنصر او كائن

source: SYNTAX
ar: بناء الجملة

source: 26:Rules for how to write a programming language
ar: قواعد كتابة لغة البرمجة

source: STRING
ar: نص

source: 27: Text, used inside of quotes i.e. 'text')
ar: نص مستخدم داخل علامات الاقتباس او التنصيص
